[{"id":1614816000,"title":"Building new website 🤖 ","author":"Einar Guðni Guðjónsson","date":"04 March 2021","description":"More details.","slug":"new-site-v2","content":"\n\n# Building my new website 🔧\n\nLike I mentioned in my first <a href=\"https://www.einargudni.com/blog/1612656000\">post</a>  I stumbled up on a website that Brittany Chang made. I liked the look of her site instantly and since she was fine with people forking her repo I thought that it would be a good starting point for my new website.\nThe reason why I decided to go with a 'template' the someone else made is because I'm not a good designer, and I would probably have spent million hours to trying to design something that I will end not satisfied on.\n\nOne thing I decided to do was build the website using <a href=\"https://reactjs.org/\">React</a> and by that I mean `create-react-app` instead of <a href=\"https://www.gatsbyjs.com/\">Gatsby</a>. \n\nI thought it would be good for me to build it with React, it forced me to start almost from scratch and build it from ground up. I also wanted to add some features, and since I would be building it from scratch with React it was a good point to add some of these features early in the process. Instead of trying to add these features to the pre made project.\n\nWhen I was almost finished with building the website a thought arrived and it was that perhaps I just should've used <a href=\"https://nextjs.org/\">Next.js</a> 🤐\nI'll probably end up remaking tyhis website in nextjs, but for now this will do.\n\n\nI started with `create-react-app` since that is a great place to start with a quick and easy react application.\nI wanted to implement a dark mode, so I used <a href=\"https://css-tricks.com/a-dark-mode-toggle-with-react-and-themeprovider/\">this</a> post as a guideline to build the useDarkMode hook that handled the dark mode functionality\n\n### Routes\n\nI also wanted to start a blog, to write posts like this, and that meant I had to use use `react-router-dom` to handle the routes. But also decide how to build, generate and publish the posts.\n\nTo handle different routes i had to do some tricks since `create-react-app` does only make client-side rendered webpage, I had build and manage the routes in  a different way if I had used gatsby.js\n\n\nI made this `Main.js` component to hold all of the routes that I needed for this website, this component was then rendered in `App.js`  along with Navbar, Footer and social information.\nNote this is just a small snippet for the component, not the whole component.\n![App](https://imgur.com/HYmLN1H)\n\n\n### Blog\nI decided to use markdown to write the blog posts, I use <a href=\"https://obsidian.md/\">Obsidian</> quite a lot. To organize, take notes and learn more. I write in markdown in Obsidian so I can write my posts there and then post them when they are ready.\nI made a simple yet effective function to handle the blogposts, I used videos from <a href=\"https://www.youtube.com/watch?v=gT1v33oA1gI&list=PLASldBPN_pkBfRXOkBOaeCJYzCnISw5-Z&ab_channel=willjw3\">this</a> playlist from willjw3 as a guideline.\n\nIn this setup I can write my posts in Obsidian, with correct format, and then just copy them to my project folder. I do need to run one small npm script to make the post visible on the site. It is simple and works.\n\n### Styled Components\n\nFor this time being I used most of the styled components Brittany made. With some minor changes, I will make some changes over time, just for my own fun. This is the first time I've really used styled components, so it is a good opportunity for me to play around with them to see what they are capable of.\nI like styled components, they did provide good consistency for me but they will bloat the files quite lot. I'm looking forward to use them more and see what they are capable of.\n\n### Conclusion\n\nI'm very happy with my new site. I could never have designed such a good looking website, so all kufos goes to Brittany Chang for her great design.\nIt was fun to rebuild it with React.js, all the way towards the part I thought that I should've used Next.js, but that is an opportunity for a new blogpost in the future.\nThese are my first steps into writing so let's hope i'll get better!\nI have some planned posts and projects so stick around."},{"id":1612656000,"title":"New Website ","author":"Einar Guðni Guðjónsson","date":"07 February 2021","description":"Post about my new Website","slug":"new-site","content":"\n# My new Website🥳\n\nI finally lunched a new version for my personal website, I have been wanting to finish it for few months.\n\nFirst thing first!\nThis site was originially designed by <a href=\"https://github.com/bchiang7\">Brittany Chang</a>\n\nI stumbled up on her website some time ago and instantly loved the design, simple but yet super cool.\nSo please check here website out and take a look at all the cool stuff she has made.\n\nI thought this would be great starting point to start my updated website. I'm not yet a good designer, so I thought it would be better to start with something and then spend time on changing and updating the site from that. \n\nI have made some changes to the website.\nThe biggest change is probably that I built it with React, Brittany made her side with Gatsby. I made the website from a simple  <code>create-react-app</code>\n\nFrom there I mainly just used the styled components Brittany made.\n\nI had to handle routes in a different way, since React is client-side rendered and Gatsby is server-side.\nI've also wanted to start a blog for some time, so I thougth that this would be a great time to start.\n\nThe blog posts are markdown files. I found a great playlist on youtube where <a href=\"https://www.youtube.com/watch?v=gT1v33oA1gI&list=PLASldBPN_pkBfRXOkBOaeCJYzCnISw5-Z&ab_channel=willjw3\">willjw3</a> built a blog using React, Node and react-markdown. This part of the website will probably go often through some updates and tweeks. I'll probably write a blog post in the future describing the process. \n\nI also made a dark-mode, since <i>everyone</i> loves dark-mode. It also gave me extra practice to use react hooks.\n\nThe website is not complete, there are some things that need to be improved. But I'm happy enough to deploy it, from now on I will add updateds and changes.\n\nI will do a more detailed post about the process of building the website later."}]